{
  "version": "n8n@1.113.1",
  "content": [
    "View the commits for this version.\nRelease date: 2025-09-23",
    "Next version\nThis is the next version. n8n recommends using the latest version. The next version may be unstable. To report issues, use the forum.",
    "This release contains bug fixes.",
    "Data tables#\nWe’re excited to introduce data tables, bringing built-in data storage to n8n. You can now store and query structured data directly inside the platform, without relying on external databases for many common automation scenarios. Track workflow state between runs, store tokens or session data, keep product or customer reference tables, or stage intermediate results for multi-step processes.\n\nPreviously, persisting data meant provisioning and connecting to an external store such as Redis or Google Sheets. That added credential setup, infrastructure overhead, latency, and constant context switching. Data tables eliminate that friction and keeps your data easily editable and close to your workflows.\n\nData tables are available today on all plans. They currently support numbers, strings, and datetimes with JSON support coming soon.  On Cloud, each instance can store up to 50 MB. On self-hosted setups, the default is also 50 MB, but this limit can be adjusted if your infrastructure allows.\n\n\n\nOverview of data tables\n\nHow to#\nCreate a data table#\n\nFrom the canvas, open the Create workflow dropdown and select Create Data table.\nOr, go to the Overview panel on the left-side navigation bar and open the Data tables tab.\n\nUse a data table in your workflow#\n\nAdd the Data table node to your workflow to get, update, insert, upsert, or delete rows.\n\nAdjust the storage limit (self-hosted only)#\n\nChange the default 50 MB limit with the environment variable: N8N_DATA_TABLES_MAX_SIZE_BYTES. See configuration docs.\n\nKeep in mind#\n\nData tables don’t currently support foreign keys or default values.\nFor now, all data tables are accessible to everyone in a project.  More granular permissions and sharing options are planned.\n\nLearn more about data tables and the Data table node.",
    "For full release details, refer to Releases on GitHub."
  ],
  "scraped_at": "2025-09-24T09:03:56.527890"
}